#include <iostream>
#include <iomanip>
using namespace std;

int main(){
 int m; cin >> m;
 
 
  long long i = 2; // дільник
  long long res = 0; // результат
  long long k = 10; // розряд числа 
  bool iii = 1; 
  while (i < m) {

   if (m % i == 0) { 
    //формує число з н дільників, 
    for (int j = 1; (m % i == 0); j++) {
     if (iii) {
      res += i; iii = 0; //додає до рес ПЕРШИЙ дільник 
     }
     else {
      res = (i * k) + res; /*і-дільник множться на число розряду к(ну там 10-100-1000)
      і до кінця плюсується рес тобто минулі дільники */
      k *= 10; 
     }
     m /= i; // зменшення вхідного число т. е. "того що розкладається на множники" (щоб цикл закінчився колись)

    }
   }
   i++; // збільшення дільника на один якщо на попередній не ділилось
  }
  // в кінці може залишитись просте число його тоже додаєм вперед 
  if (m > 1) {
   if (m > 9) cout << -1; 
   else {
    res = (m * k) + res;
    cout << res;
   }
  }
  else cout << res;
 
}
